<h2 id="Contents">Contents<a href="#Contents"></a></h2>
        <ol>
        <ol><li><a class="" href="#Loading-the-Database">Loading the Database</a></li>
<li><a class="" href="#Inner-Join">Inner Join</a></li>
<ol><li><a class="" href="#Inner-Join-via-USING">Inner Join via USING</a></li>
<li><a class="" href="#Self-join">Self-join</a></li>
<li><a class="" href="#Case-when-and-then">Case when and then</a></li>
</ol><li><a class="" href="#Outer-Joins">Outer Joins</a></li>
<ol><li><a class="" href="#Left-and-Right-Joins">Left and Right Joins</a></li>
<li><a class="" href="#Full-Joins">Full Joins</a></li>
<li><a class="" href="#Cross-Joins">Cross Joins</a></li>
</ol><li><a class="" href="#Set-Operations">Set Operations</a></li>
<ol><li><a class="" href="#Union">Union</a></li>
<li><a class="" href="#Intersect-Syntax">Intersect Syntax</a></li>
<li><a class="" href="#Except-Syntax">Except Syntax</a></li>
<li><a class="" href="#Semi-Join">Semi-Join</a></li>
<li><a class="" href="#Anti-Join">Anti-Join</a></li>
</ol><li><a class="" href="#Subqueries">Subqueries</a></li>
<ol><li><a class="" href="#Subqueries-inside-WHERE">Subqueries inside WHERE</a></li>
<li><a class="" href="#Subqueries-Inside-SELECT">Subqueries Inside SELECT</a></li>
<li><a class="" href="#Subqeuries-Inside-FROM">Subqeuries Inside FROM</a></li>
<li><a class="" href="#Some-Examples-of-Subqueries">Some Examples of Subqueries</a></li>
<ol><li><a class="" href="#1">1</a></li>
<li><a class="" href="#2">2</a></li>
<li><a class="" href="#3">3</a></li>
</ol>

## Loading the Database

In [1]:
%load_ext sql
%sql mysql://hari31416:****@localhost:8080/movies

Let's see what tables do we have:

In [2]:
%sql SHOW TABLES

 * mysql://hari31416:***@localhost:8080/movies
17 rows affected.

[('country',),
 ('department',),
 ('gender',),
 ('genre',),
 ('keyword',),
 ('language',),
 ('language_role',),
 ('movie',),
 ('movie_cast',),
 ('movie_company',),
 ('movie_crew',),
 ('movie_genres',),
 ('movie_keywords',),
 ('movie_languages',),
 ('person',),
 ('production_company',),
 ('production_country',)]

We have over 15 tables in our database.

How are these tables related to each other? Here is the ERD:

![](img/03_01.png)

For more details related to the database, follow the [link](https://www.databasestar.com/sample-database-movies/).

## Inner Join

<figure>
<figcaption><p>Inner Join</p><f/igcaption>
<img src="img/01_0.png"/>
</figure>

The basic syntax for an `INNER JOIN`, here including all columns in both tables:

>SELECT * <br>
FROM left_table <br>
INNER JOIN right_table <br>
ON left_table.id = right_table.id;

In [10]:
%%sql
SELECT *
FROM movie
INNER JOIN movie_genres
ON movie.movie_id = movie_genres.movie_id
LIMIT 5;

 * mysql://hari31416:***@localhost:8080/movies
5 rows affected.

[(5, 'Four Rooms', 4000000, '', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", Decimal('22.876230'), datetime.date(1995, 12, 9), 4300000, 98, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", Decimal('6.50'), 530, 5, 35),
 (5, 'Four Rooms', 4000000, '', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", Decimal('22.876230'), datetime.date(1995, 12, 9), 4300000, 98, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", Decimal('6.50'), 530, 5, 80),
 (11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624, 11, 12),
 (11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624, 11, 28),
 (11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624, 11, 878)]

Let's do another join to get a list of movies with Action genre

In [18]:
%%sql
SELECT title
FROM movie
INNER JOIN movie_genres
ON movie.movie_id = movie_genres.movie_id
INNER JOIN genre
ON movie_genres.genre_id = genre.genre_id
WHERE genre.genre_name = 'Action'
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[('Star Wars',),
 ('The Fifth Element',),
 ('Pirates of the Caribbean: The Curse of the Black Pearl',),
 ('Kill Bill: Vol. 1',),
 ("Pirates of the Caribbean: Dead Man's Chest",),
 ('英雄',),
 ('Raiders of the Lost Ark',),
 ('Indiana Jones and the Temple of Doom',),
 ('Indiana Jones and the Last Crusade',),
 ('Beverly Hills Cop',)]

Instead of writing the full table name, you can use table aliasing as a shortcut. For tables you also use `AS` to add the alias immediately after the table name with a space. Check out the aliasing of cities and countries below.

>SELECT c1.name AS city, c2.name AS country <br>
FROM cities AS c1<br>
INNER JOIN countries AS c2<br>
ON c1.country_code = c2.code;

Notice that to select a field in your query that appears in multiple tables, you'll need to identify which table/table alias you're referring to by using a `.` in your `SELECT` statement.

In SQL, the joining can be done for even multiple tables.
>SELECT * <br>
FROM left_table <br>
  INNER JOIN right_table <br>
    ON left_table.id = right_table.id <br>
  INNER JOIN another_table <br>
    ON left_table.id = another_table.id; <br>

When doing this type of long joining, it becomes useful to alias each table using the first letter of its name (e.g. `countries AS c`)!

### Inner Join via `USING`

When joining tables with a common field name, e.g.
>SELECT *<br>
FROM countries<br>
  INNER JOIN economies<br>
    ON countries.code = economies.code<br>

You can use USING as a shortcut:
>SELECT *<br>
FROM countries<br>
  INNER JOIN economies<br>
    USING(code)

In [20]:
%%sql
SELECT *
FROM movie
INNER JOIN movie_genres
USING(movie_id)
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[(5, 'Four Rooms', 4000000, '', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", Decimal('22.876230'), datetime.date(1995, 12, 9), 4300000, 98, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", Decimal('6.50'), 530, 35),
 (5, 'Four Rooms', 4000000, '', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", Decimal('22.876230'), datetime.date(1995, 12, 9), 4300000, 98, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", Decimal('6.50'), 530, 80),
 (11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624, 12),
 (11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624, 28),
 (11, 'Star Wars', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', Decimal('126.393695'), datetime.date(1977, 5, 25), 775398007, 121, 'Released', 'A long time ago in a galaxy far, far away...', Decimal('8.10'), 6624, 878),
 (12, 'Finding Nemo', 94000000, 'http://movies.disney.com/finding-nemo', "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome ... (35 characters truncated) ... orgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.", Decimal('85.688789'), datetime.date(2003, 5, 30), 940335536, 100, 'Released', "There are 3.7 trillion fish in the ocean, they're looking for one.", Decimal('7.60'), 6122, 16),
 (12, 'Finding Nemo', 94000000, 'http://movies.disney.com/finding-nemo', "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome ... (35 characters truncated) ... orgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.", Decimal('85.688789'), datetime.date(2003, 5, 30), 940335536, 100, 'Released', "There are 3.7 trillion fish in the ocean, they're looking for one.", Decimal('7.60'), 6122, 10751),
 (13, 'Forrest Gump', 55000000, '', "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what  ... (108 characters truncated) ... rest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.", Decimal('138.133331'), datetime.date(1994, 7, 6), 677945399, 142, 'Released', "The world will never be the same, once you've seen it through the eyes of Forrest Gump.", Decimal('8.20'), 7927, 18),
 (13, 'Forrest Gump', 55000000, '', "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what  ... (108 characters truncated) ... rest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.", Decimal('138.133331'), datetime.date(1994, 7, 6), 677945399, 142, 'Released', "The world will never be the same, once you've seen it through the eyes of Forrest Gump.", Decimal('8.20'), 7927, 35),
 (13, 'Forrest Gump', 55000000, '', "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what  ... (108 characters truncated) ... rest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.", Decimal('138.133331'), datetime.date(1994, 7, 6), 677945399, 142, 'Released', "The world will never be the same, once you've seen it through the eyes of Forrest Gump.", Decimal('8.20'), 7927, 10749)]

### Self-join

Self-join is exactly what it says it is. It joins a table with itself. But why would we do that? Well, it can be used to perform some special queries. The syntax is:
>SELECT p1.country_code, p1.size as size2010, p2.size as size2015<br>
FROM populations (alias as p1)<br>
FROM populations as p1<br>
Join to itself (alias as p2)<br>
  INNER JOIN populations as p2<br>
Match on country code<br>
    USING(country_code)<br>
    AND p1.year = p2.year - 5

Here, using self-join we can calculate the increase in population from 2010 to 2015 for each country code! Using 
>((p2.size - p1.size)/p1.size * 100.0) AS growth_percent

also gives the percentage growth.

### Case when and then

Often it's useful to look at a numerical field not as raw data, but instead as being in different categories or groups. We can use `CASE` with `WHEN`, `THEN`, `ELSE`, and `END` to define a new grouping field. The syntax is:

>SELECT name, continent, code, surface_area,<br>
    CASE WHEN surface_area > 2000000 THEN 'large'<br>
        -- Second case<br>
        WHEN surface_area > 350000 THEN 'medium'<br>
        -- Else clause + end<br>
        ELSE 'small' END<br>
        -- Alias name<br>
        AS geosize_group<br>
-- From table<br>
FROM countries;

Using `INTO countries_plus` just before `FROM` is a shortcut for creating a new table with the same columns as the original table plus the new field.

In [35]:
%%sql
SELECT title,
CASE 
    WHEN budget>200000000 THEN 'Huge'
    WHEN budget>100000000 THEN 'Big'
    WHEN budget>50000000 THEN 'Medium'
    ELSE 'Small'
END as 'Budget'
FROM movie
LIMIT 10;

 * mysql://hari31416:***@localhost:8080/movies
10 rows affected.

[('Four Rooms', 'Small'),
 ('Star Wars', 'Small'),
 ('Finding Nemo', 'Medium'),
 ('Forrest Gump', 'Medium'),
 ('American Beauty', 'Small'),
 ('Dancer in the Dark', 'Small'),
 ('The Fifth Element', 'Medium'),
 ('Metropolis', 'Medium'),
 ('My Life Without Me', 'Small'),
 ('Pirates of the Caribbean: The Curse of the Black Pearl', 'Big')]

## Outer Joins

### Left and Right Joins

<figure>
<figcaption><p>Left Join</p><f/igcaption>
<img src="img/01_01.png"/>
</figure>

<figure>
<figcaption><p>Right Join</p><f/igcaption>
<img src="img/01_02.png"/>
</figure>

The syntax for these is similar to the `INNER JOIN` syntax, but with a `LEFT` or `RIGHT` keyword in front of the `INNER` keyword.

>Right joins aren't as common as left joins. One reason why is that you can always write a right join as a left join.

### Full Joins

<figure>
<figcaption><p>Full Join</p><f/igcaption>
<img src="img/01_03.png"/>
</figure>

>The `FULL JOIN` query returned 17 rows, the `OUTER JOIN` returned 4 rows, and the `INNER JOIN` only returned 3 rows.

### Cross Joins

<figure>
<figcaption><p>Cross Join</p><f/igcaption>
<img src="img/01_04.png"/>
</figure>

## Set Operations

<figure>
<figcaption><p>Venn Diagrams</p><f/igcaption>
<img src="img/01_06.png"/>
</figure>

### Union

<figure>
<figcaption><p>Union Syntax</p><f/igcaption>
<img src="img/01_05.png"/>
</figure>

### Intersect Syntax

<figure>
<figcaption><p>Intersect Syntax</p><f/igcaption>
<img src="img/01_07.png"/>
</figure>

### Except Syntax

<figure>
<figcaption><p>Except Syntax</p><f/igcaption>
<img src="img/01_08.png"/>
</figure>

### Semi-Join

<figure>
<figcaption><p>Semi Join</p><f/igcaption>
<img src="img/01_-1.png"/>
</figure>

<figure>
<figcaption><p>Semi Syntax</p><f/igcaption>
<img src="img/01_09.png"/>
</figure>

>The above syntax shows an example of inner query, where the result of the inner query is used in the outer query.

>SELECT DISTINCT name<br>
FROM languages<br>
WHERE code IN<br>
  (SELECT code<br>
   FROM countries<br>
   WHERE region = 'Middle East')<br>
ORDER BY name;

This query returns the names of all languages spoken in the Middle East.

Sometimes problems solved with semi-joins can also be solved using an inner join.
>SELECT DISTINCT languages.name AS language<br>
FROM languages<br>
INNER JOIN countries<br>
ON languages.code = countries.code<br>
WHERE region = 'Middle East'<br>
ORDER BY language;

### Anti-Join

<figure>
<figcaption><p>Anti Join</p><f/igcaption>
<img src="img/01_-2.png"/>
</figure>

<figure>
<figcaption><p>Anti-join Syntax</p><f/igcaption>
<img src="img/01_10.png"/>
</figure>

>As we can see, the syntax is almost identical to the semi-join with `IN` replaced with `NOT IN`.

It is particularly useful in identifying which records are causing an incorrect number of records to appear in join queries.

## Subqueries

### Subqueries inside `WHERE`

The most basic way to use subqeuries is inside the `WHERE` clause. The following query returns all the sates in continent Asia where the fertility rate is lower than avergare.

<figure>
<figcaption><p>Subqueries inside WHERE</p><f/igcaption>
<img src="img/01_11.png"/>
</figure>

>-- Select fields<br>
SELECT name, country_code, urbanarea_pop<br>
  -- From cities<br>
  FROM cities<br>
-- Where city name in the field of capital cities<br>
WHERE name IN<br>
  -- Subquery<br>
  (SELECT capital<br>
   FROM countries)<br>
ORDER BY urbanarea_pop DESC;

The above query gets the urban area population for only capital cities.

In [39]:
%%sql
SELECT title, budget
FROM movie
WHERE budget = (
    SELECT MAX(budget)
    FROM movie
);

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[('Pirates of the Caribbean: On Stranger Tides', 380000000)]

In [45]:
%%sql
SELECT COUNT(*) as "Successful"
FROM movie
WHERE title IN (
    SELECT title
    FROM movie
    WHERE budget>revenue
);

 * mysql://hari31416:***@localhost:8080/movies
1 rows affected.

[(1327,)]

### Subqueries Inside `SELECT`

<figure>
<figcaption><p>Subqueries inside SELECT</p><f/igcaption>
<img src="img/01_12.png"/>
</figure>

The query above returns the count of countries which are listed in both the `prime_minister` table and states `table`.

Sometimes, a query, done by `INNER JOIN` can also be done using a subquery.

SELECT countries.name AS country, COUNT(*) AS cities_num<br>
  FROM cities<br>
    INNER JOIN countries<br>
    ON countries.code = cities.country_code<br>
GROUP BY country<br>
ORDER BY cities_num DESC, country<br>
LIMIT 9;

SELECT name AS country,<br>
  (SELECT COUNT(*)<br>
   FROM cities<br>
   WHERE countries.code = cities.country_code) AS cities_num<br>
FROM countries<br>
ORDER BY cities_num DESC, country<br>
LIMIT 9;

Both these queries give the same result.

### Subqeuries Inside `FROM`

<figure>
<figcaption><p>Subqueries inside FROM</p><f/igcaption>
<img src="img/01_13.png"/>
</figure>

> SELECT local_name, lang_num <br>
 FROM countries,<br>
  	(SELECT code, COUNT(*) AS lang_num<br>
  	 FROM languages<br>
  	 GROUP BY code) AS subquery<br>
  WHERE countries.code = subquery.code<br>
ORDER BY lang_num DESC;

The above query counts the number of languages spoken for each country, identified by the country's local name

### Some Examples of Subqueries

#### 1

>SELECT cities.name, country_code, city_proper_pop, metroarea_pop,  <br>
      city_proper_pop / metroarea_pop * 100 AS city_perc <br>
  FROM cities <br>
  WHERE cities.name IN <br>
    (SELECT capital <br>
     FROM countries <br>
     WHERE (continent = 'Europe' <br>
        OR continent LIKE '%America%')) <br>
       AND metroarea_pop IS NOT NULL <br>
ORDER BY city_perc DESC <br>

Returns top 10 capital cities in Europe and the Americas in terms of a calculated percentage using city_proper_pop and metroarea_pop in cities.

#### 2

>SELECT DISTINCT c.name, e.total_investment, e.imports<br>
  FROM countries AS c<br>
    LEFT JOIN economies AS e<br>
      ON (c.code = e.code)<br>
        AND c.code IN (<br>
          SELECT l.code<br>
          FROM languages AS l<br>
          WHERE official = 'true'<br>
        ) <br>
  WHERE region = 'Central America' AND year = 2015<br>
ORDER BY c.name;

Gets the country names and other 2015 data in the economies table and the countries table for Central American countries with an official language.
<br>
Here, you can see that subqueries can even be applied on `ON`.

#### 3

>SELECT code, inflation_rate, unemployment_rate <br>
  FROM economies<br>
  WHERE year = 2015 AND code NOT IN<br>
  	(SELECT code<br>
  	 FROM countries<br>
  	 WHERE (gov_form = 'Constitutional Monarchy' OR gov_form LIKE '%Republic%'))<br>
ORDER BY inflation_rate;

Here, we use a subquery to get 2015 economic data for countries that do not have<br>
* `gov_form` of **'Constitutional Monarchy'** or
* **'Republic'** in their `gov_form`.